---
title: SlabShapeVertexArray
classe: Autodesk.Revit.DB.SlabShapeVertexArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# SlabShapeVertexArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `slabShapeVertexArray.IsEmpty` | Boolean |
| `SlabShapeVertex Item { get; set; }` | `slabShapeVertexArray.Item` | SlabShapeVertex |
| `Int32 Size { get; }` | `slabShapeVertexArray.Size` | Int32 |
| `Void Append(SlabShapeVertex)` | `slabShapeVertexArray.Append(item)` | Void |
| `Void Clear()` | `slabShapeVertexArray.Clear()` | Void |
| `SlabShapeVertexArrayIterator ForwardIterator()` | `slabShapeVertexArray.ForwardIterator()` | SlabShapeVertexArrayIterator |
| `IEnumerator GetEnumerator()` | `slabShapeVertexArray.GetEnumerator()` | IEnumerator |
| `Void Insert(SlabShapeVertex, Int32)` | `slabShapeVertexArray.Insert(item, index)` | Void |
| `SlabShapeVertexArrayIterator ReverseIterator()` | `slabShapeVertexArray.ReverseIterator()` | SlabShapeVertexArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```